{"basics":{"name":"Shiyu Feng","label":"Ph.D. Candidate","image":"","email":"","phone":"","url":"https://shiyuf.github.io/","summary":"","location":{"address":"85 5th St NW","postalCode":"GA 30308","city":"Atlanta","countryCode":"US","region":"Georgia"},"profiles":[{}]},"education":[{"institution":"Georgia Institute of Technology","url":"","area":"Robotics and Mechanical Engineering","studyType":"PhD Candidate","startDate":"2016-08","endDate":"Exp 2024-05","score":"","courses":["Advisor: Dr. Patricio A. Vela","Co-Advisor: Dr. Jun Ueda"]},{"institution":"University of California, Berkeley","url":"","area":"Mechanical Engineering","studyType":"Master","startDate":"2015-08","endDate":"2016-05","score":""},{"institution":"Chongqing University","url":"","area":"Mechanical Engineering","studyType":"Bachelor","startDate":"2011-09","endDate":"2015-07","score":""}],"work":[{"name":"Georgia Institute of Technology, IVALab","position":"Graduate Research Assistant","url":"","startDate":"2017-05","endDate":"Present","summary":"Hierarchical Stereo Navigation with Sparse Representation. Supervised by Dr. Patricio A. Vela","highlights":["Created a sparse perception space for real-time collision checking and path planning, which has better computational efficiency and scalability among different workstations and lightweight embedded devices.","Designed safety-guaranteed path planning methods for holonomic and nonholonomic dynamics involving optimal control, potential fields, and control barrier functions.","Built an image-based trajectory tracking method with VSLAM to reduce reliance on pose estimation accuracy.","Implemented a hierarchical vision-based navigation framework (GPF-BG) for safe quadrupedal navigation.","Developed multiple real-time hierarchical navigation systems containing perception, planning, and control modules for different robotic platforms: mobile robots, mobile manipulation robots, snake-like robots, and quadrupedal robots.","Benchmarked navigation performance in ROS/Gazebo simulation and real robots (Turtlebot, LoCoBot, Stretch, Unitree A1) with stereo cameras, depth cameras, and laser scanners.","Trained an explainable deep learning model to synthesize ego-centric collision-free trajectories from stereo images.","Research to deploy reinforcement learning models for navigation and object searching in a mobile manipulation task."]},{"name":"Georgia Institute of Technology, ECE","position":"ORS and VIP Undergraduate Research Mentor","url":"","startDate":"2019-08","endDate":"Present","summary":"Supervise and organize 8+ undergraduate research projects on vision-based navigation with SLAM, perception, planning, control, deep learning, software and hardware design, etc."},{"name":"Seres (SF Motors), ADAS Team","position":"Perception Engineer Intern","url":"","startDate":"2018-05","endDate":"2018-08","summary":"Supervised by Chongyu Wang and Fan Wang","highlights":["Individually implemented C++ OpenCV algorithm to achieve stop-line and traffic light detection.","Contributed to deep learning traffic detection and data preparation.","Deployed classical and learning-based algorithms in autonomous driving field tests.","Assisted in completing camera installation, sensor calibration, and real-time image acquisition."]},{"name":"Georgia Institute of Technology, ME","position":"Teaching Practicum","url":"","startDate":"2021-08","endDate":"2021-12","summary":"ME 3017: System Dynamics. Supervised by Dr. Jun Ueda","highlights":["Collaborated in developing course materials, homework, and exams.","Provided weekly office hours and taught some lectures."]},{"name":"Georgia Institute of Technology, ME","position":"Graduate Teaching Assistant","url":"","startDate":"2016-08","endDate":"2019-08","summary":"ME2110: Creative Decisions and Design. Supervised by Dr. Thomas Kurfess and Dr. Christopher Saldana","highlights":["Instructor for mechatronics and machining training. Conduct machining open labs.","Served as a head TA for one semester to arrange TA training, open labs, and the final competition."]},{"name":"University of California, Berkeley, MPC Lab","position":"Graduate Research Intern","url":"","startDate":"2016-08","endDate":"2019-08","summary":"Fault Tolerant Control in Autonomous Driving, Perception. Advised by Dr. Francesco Borrelli","highlights":["Built the main sensor data association algorithm in Python with an external optimization solver.","Tested the sensor association algorithm in simulation and on a real autonomous driving car."]}],"volunteer":[],"awards":[],"certificates":[],"publications":[],"skills":[{"name":"Perception, Path Planning, Control, Robot Safety, Obstacle Avoidance, Real-time System, C/C++, Python, MATLAB, LabVIEW, OpenCV, ROS, Gazebo, CasADi, PCL, Linux, GitHub, Jira, PyTorch, TensorFlow, Weka, Solidwords"}],"languages":[{"language":"Chinese","fluency":"Native speaker"},{"language":"English","fluency":"Fluent"}],"interests":[],"references":[],"projects":[]}